In [5]:
import pandas as pd

df = pd.read_excel("estudiantes.xlsx")

df

    Nombre  Edad      Carrera  Promedio  Semestre
0      Ana    20   Ingeniería       8.5         4
1     Luis    22  Matemáticas       9.2         6
2    María    21   Ingeniería       7.8         3
3   Carlos    23      Derecho       8.9         8
4    Sofía    20     Medicina       9.5         5
5    Pedro    24   Ingeniería       6.9         2
6     Omar    23     Actuaría       9.5         3
7  Antonio    22   Contaduría       8.0         2
8   Sergio    25   Ingeniería       7.0         9
9   Daniel    25     Medicina       7.6         9

In [6]:
print(df.dtypes)

Nombre       object
Edad          int64
Carrera      object
Promedio    float64
Semestre      int64
dtype: object

pandas.core.frame.DataFrame

In [3]:
df = df.astype({
    "Nombre": "string",
    "Edad": "int",
    "Carrera": "string",
    "Promedio": "float",
    "Semestre": "int"
})